ci/app/Controllers/Client.php

INSERT INTO `validasi` (`email`, `hash`, `created_at`, `updated_at`) VALUES ('suluh@gmail.com', 'fde8a12d559dcee6421bbb6590f8f988', '2023-08-23 04:58:23', '2023-08-23 04:58:23')
---
            $userModel->insert($newUserData);
            if ($userModel->affectedRows() > 0) {
              $newHash = md5($_POST['email'].idate("U"));
              $mdlValidasi->insert(array('email'=>$_POST['email'], 'hash'=>$newHash));

SELECT *
FROM `validasi`
WHERE `email` = 'suluh@gmail.com'
---
  function sendEmail($to_email)
  {
    if (filter_var($to_email, FILTER_VALIDATE_EMAIL)) {
    $mdlValidasi = new \App\Models\MdlValidasi();
   $hashVerify = $mdlValidasi->where(array('email'=>$to_email))->get()->getResultArray()[0]['hash'];