ci/app/Controllers/Home.php

  function getSlider(){
      $data = new \App\Models\MdlSlider();
      $data->where(array('status' =>1 ,'deleted_at'=>null ));
      return json_encode($data->get()->getResultArray());
---
SELECT *
FROM `slider`
WHERE `status` = 1
AND `deleted_at` IS NULL

  function getGroupProduct(){
      $mdl = new \App\Models\MdlProductGroup();
      $data = $mdl->where('deleted_at',null)->get()->getResult();
---
SELECT *
FROM `product_group`
WHERE `deleted_at` IS NULL