app/Controllers/Changelog.php

    function riwayat($riwayat){
        if (isset($_SESSION['auth'])) {
            $nama_admin = $_SESSION['auth']['name'];
            $id_admin = $_SESSION['auth']['id'];
          }else{
            $nama_admin = "Unknown user";
            $id_admin = 0;
          }

          $ip = $_SERVER['REMOTE_ADDR'];
          $changelog = ['nama_admin'=> $nama_admin,
          'id_google'=>$id_admin,
          'ip'=>$ip,
          'created_at'=>date("Y-m-d H:i:s"),
          'updated_at'=>date("Y-m-d H:i:s"),
          'riwayat'=> $riwayat,
        ];
        $builder_changelog = $this->db->table('changelog');
        $builder_changelog->insert($changelog);
---
INSERT INTO `changelog` (`nama_admin`, `id_google`, `ip`, `created_at`, `updated_at`, `riwayat`) VALUES (' ', '110246320954904130279', '::1', '2023-08-23 05:16:57', '2023-08-23 05:16:57', 'User arw com berhasil login kembali')